# # задача 1
# a. создайте функцию task_1(), в теле функции:
# i. создайте 5 разных переменных с произвольным названием.
# ii. у каждой укажите тип, типы следующие
# 1. int, float, str, list, bool
# iii. заполните переменные произвольными значениями, с соответствующим для каждой типом
# iv. выведите тип данных каждой в консоль.
# b. в функцию добавьте аннотацию возвращаемых данных
# c. добавьте вызов функции.

def task_1(integer: int, tochka: float, string: str, spisok: list, truefalse: bool) -> list[type]:
    return [type(integer), type(tochka), type(string), type(spisok), type(truefalse)]
itog = task_1(1, 1.3, 'nadpis', [1, 2, 3, 4], False)
print(itog)



# задача 2
# a. создайте функцию task_2(), в теле функции:
# i. есть список a = [1, 2, 3, 5, 8, 13, 21]
# ii. выведите в консоль первые 3 значения списка
# b. в функцию добавьте аннотацию возвращаемых данных
# c. добавьте вызов функции.
# d. * - скажите как называется эта последовательность чисел
def task_2(a:list):
    return list(a[0:2])
itog_2 = task_2([1, 2, 3, 5, 8, 13, 21])
print(itog_2)
# числа Фибоначчи



# задача 3
# a. напишите функцию task_3(), которая принимает число и возвращает квадрат этого числа.
# b. пропишите аннотации для функции и аргумента
# c. распечатайте в консоль вызов функции

def task_3(a:int):
    return a ** 2
print(task_3(5))